{
  "faction": "Orks",
  "lastUpdated": "2026-01",
  "units": [],
  "detachments": {
    "waaagh_tribe": {
      "name": "Waaagh! Tribe",
      "rules": [
        {
          "id": "get-stuck-in",
          "name": "Get Stuck In",
          "description": "Each time an ORKS model from your army makes a melee attack, if it made a Charge move this turn, or it was charged this turn, add 1 to the Strength characteristic of that attack. In addition, melee weapons equipped by ORKS models from your army have the [SUSTAINED HITS 1] ability.",
          "type": "passive",
          "modifiers": [
            {
              "stat": "s",
              "operation": "add",
              "value": 1,
              "scope": "melee",
              "condition": "on charge or charged"
            }
          ],
          "weaponAbilities": ["Sustained Hits 1"]
        }
      ],
      "stratagems": [
        {
          "id": "unbridled-carnage",
          "name": "Unbridled Carnage",
          "cost": 1,
          "phase": "Fight",
          "description": "Use this Stratagem in the Fight phase. Select one ORKS unit from your army that has not been selected to fight this phase. Until the end of the phase, each time a model in that unit makes a melee attack, a Critical Hit is scored on an unmodified Hit roll of 5+ instead of only a 6.",
          "modifiers": []
        },
        {
          "id": "orks-is-never-beaten",
          "name": "Orks Is Never Beaten",
          "cost": 2,
          "phase": "Fight",
          "description": "Use this Stratagem in the Fight phase, just after an enemy unit has selected its targets. Select one ORKS unit from your army that was selected as the target of one or more of that enemy unit's attacks. Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, do not remove it from play. The destroyed model can fight after the attacking model's unit has finished making its attacks, and is then removed from play.",
          "modifiers": []
        },
        {
          "id": "ere-we-go",
          "name": "'Ere We Go",
          "cost": 1,
          "phase": "Movement",
          "description": "Use this Stratagem at the start of your Movement phase. Select one ORKS INFANTRY unit from your army. Until the end of the turn, add 2 to Advance and Charge rolls made for that unit.",
          "modifiers": []
        },
        {
          "id": "ard-as-nails",
          "name": "'Ard as Nails",
          "cost": 1,
          "phase": "Opponent's Shooting/Fight",
          "description": "Use this Stratagem in your opponent's Shooting phase or the Fight phase, just after an enemy unit has selected its targets. Select one ORKS unit from your army (excluding GROTS, MONSTER, and VEHICLE units) that was selected as the target of one or more of the attacking unit's attacks. Until the end of the phase, each time an attack targets your unit, subtract 1 from the Wound roll.",
          "modifiers": []
        },
        {
          "id": "mob-rule",
          "name": "Mob Rule",
          "cost": 1,
          "phase": "Command",
          "description": "Use this Stratagem at the start of any phase. Select one MOB unit from your army that has 10+ models and is not Below Half-strength. Until the end of the phase, while a friendly ORKS INFANTRY unit (excluding GROTS units) is within 6\" of that MOB unit, that INFANTRY unit is treated as if it were not Battle-shocked.",
          "modifiers": []
        },
        {
          "id": "careen",
          "name": "Careen!",
          "cost": 1,
          "phase": "Any",
          "description": "Use this Stratagem in any phase, just after an ORKS VEHICLE model from your army with the Deadly Demise ability is destroyed. Do not roll to see if that model's Deadly Demise ability inflicts any mortal wounds. Instead, before removing that model from play, you can select one enemy unit within 6\" of it and roll one D6: on a 4+, that enemy unit suffers mortal wounds equal to the Deadly Demise value of the destroyed model.",
          "modifiers": []
        }
      ],
      "enhancements": [
        {
          "id": "follow-me-ladz",
          "name": "Follow Me Ladz",
          "points": 25,
          "description": "ORKS model only. While the bearer is leading a unit, add 2\" to the Move characteristic of models in that unit.",
          "modifiers": [
            { "stat": "m", "operation": "add", "value": 2, "scope": "unit" }
          ]
        },
        {
          "id": "headwoppas-killchoppa",
          "name": "Headwoppa's Killchoppa",
          "points": 20,
          "description": "ORKS model only. Melee weapons equipped by the bearer have the [DEVASTATING WOUNDS] ability.",
          "modifiers": []
        },
        {
          "id": "kunnin-but-brutal",
          "name": "Kunnin' But Brutal",
          "points": 15,
          "description": "ORKS model only. While the bearer is leading a unit, that unit is eligible to shoot and declare a charge in a turn in which it Fell Back.",
          "modifiers": []
        },
        {
          "id": "supa-cybork-body",
          "name": "Supa-Cybork Body",
          "points": 15,
          "description": "ORKS model only. The bearer has the Feel No Pain 4+ ability.",
          "modifiers": []
        }
      ]
    }
  },
  "armyRules": {
    "waaagh": {
      "name": "Waaagh!",
      "description": "Once per battle, in your Command phase, you can call a Waaagh!. If you do, until the start of your next Command phase, ORKS units from your army get +1 to Strength, +1 to Attacks (melee only), and +1 to Charge rolls. A Waaagh! can only be called if your WARLORD is an ORKS model and is on the battlefield.",
      "oncePerBattle": true,
      "keywords": ["ORKS"],
      "effects": [
        {
          "stat": "s",
          "operation": "add",
          "value": 1,
          "scope": "melee"
        },
        {
          "stat": "a",
          "operation": "add",
          "value": 1,
          "scope": "melee"
        },
        {
          "stat": "charge",
          "operation": "add",
          "value": 1,
          "scope": "unit"
        }
      ]
    }
  },
  "weaponKeywords": {
    "Devastating Wounds": "Critical wounds (unmodified wound roll of 6) inflict mortal wounds equal to the Damage characteristic, and the attack sequence ends.",
    "Lethal Hits": "Critical hits (unmodified hit roll of 6) automatically wound the target.",
    "Sustained Hits": "Critical hits generate additional hits (number specified after the ability name).",
    "Twin-linked": "Re-roll wound rolls.",
    "Assault": "Can shoot after Advancing (at -1 to hit).",
    "Pistol": "Can shoot in Engagement Range, but only at units within Engagement Range.",
    "Blast": "+1 attack per 5 models in target unit (minimum 3 attacks vs 6+ models).",
    "Rapid Fire": "Double the Attacks characteristic when targeting within half range.",
    "Heavy": "+1 to hit if the bearer's unit Remained Stationary this turn.",
    "Torrent": "Automatically hits the target.",
    "Anti-": "Improves wound roll against targets with the specified keyword (e.g., Anti-Vehicle 4+ wounds on 4+ vs Vehicles).",
    "Hazardous": "After resolving attacks, roll one D6. On a 1, bearer suffers 3 mortal wounds.",
    "Dakka": "Each time this weapon targets a unit within half range, the Attacks characteristic is increased by the number shown in brackets. For example, Dakka [2] would add 2 Attacks at half range."
  },
  "allies": [],
  "keywordGlossary": {
    "weapon": [
      { "name": "Anti-X #+", "description": "Improve AP by 1 and wound on #+ against targets with keyword X." },
      { "name": "Assault", "description": "Can be shot after Advancing." },
      { "name": "Blast", "description": "+1 Attack per 5 models in target unit." },
      { "name": "Devastating Wounds", "description": "Critical wounds inflict mortal wounds equal to Damage, no saves allowed." },
      { "name": "Dakka", "description": "Increases Attacks when targeting within half range." },
      { "name": "Heavy", "description": "+1 to hit if Remained Stationary." },
      { "name": "Hazardous", "description": "Roll D6 after attacking; on 1, bearer takes 3 mortal wounds." },
      { "name": "Lethal Hits", "description": "Critical hits automatically wound." },
      { "name": "Pistol", "description": "Can shoot in Engagement Range." },
      { "name": "Rapid Fire X", "description": "Double Attacks at half range." },
      { "name": "Sustained Hits X", "description": "Critical hits generate X extra hits." },
      { "name": "Torrent", "description": "Automatically hits." },
      { "name": "Twin-linked", "description": "Re-roll wound rolls." }
    ],
    "unit": [
      { "name": "Orks", "description": "Units from the Orks faction. Benefit from Waaagh! army rule." },
      { "name": "Mob", "description": "Large groups of Orks fighting together. Often benefit from abilities that scale with model count." },
      { "name": "Gretchin", "description": "Small, cowardly greenskins used as cannon fodder and workers by the Orks." },
      { "name": "Battleline", "description": "Core troop units. May have special rules in certain detachments." },
      { "name": "Character", "description": "Can lead units, receive Enhancements, and is targeted by Precision." },
      { "name": "Psyker", "description": "Can use Psychic abilities. Ork Weirdboyz channel the Waaagh! energy of nearby Orks." },
      { "name": "Leader", "description": "Can be attached to Bodyguard units. Abilities affect the combined unit." },
      { "name": "Mega Armour", "description": "Heavy armoured suits worn by Meganobz. Provides excellent protection but reduces mobility." },
      { "name": "Feel No Pain X+", "description": "Roll D6 when losing a wound. On X+, wound is ignored." },
      { "name": "Deadly Demise X", "description": "When destroyed, roll D6. On a 6, each unit within 6\" suffers X mortal wounds." }
    ]
  }
}
